#Область ПрограммныйИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_РегистрацияИзмененных_ПереопределяемыйИнтерфейс Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПереопределяемыйОбработчикомИнтерфейс

Функция ОбъектИБ_РегистрироватьПриЗаписи(пСсылкаИБ) Экспорт
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаИБ) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = Неопределено Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	регистрироватьПриЗаписи = РеализацияИнтерфейса.ОбъектИБ_РегистрироватьПриЗаписи(пСсылкаИБ);
		
	Если ТипЗнч(регистрироватьПриЗаписи) <> Тип("Булево") Тогда
		регистрироватьПриЗаписи = Ложь;
		
	КонецЕсли;
	
	Возврат регистрироватьПриЗаписи;
	
КонецФункции

Функция ОбъектИБ_РегистрироватьПриПоступленииПоОбмену(пСсылкаИБ, пУзелОтправитель = Неопределено) Экспорт
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаИБ) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = Неопределено Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	регистрироватьПриЗаписи = РеализацияИнтерфейса.ОбъектИБ_РегистрироватьПриПоступленииПоОбмену(пСсылкаИБ, пУзелОтправитель);
		
	Если ТипЗнч(регистрироватьПриЗаписи) <> Тип("Булево") Тогда
		регистрироватьПриЗаписи = Ложь;
		
	КонецЕсли;
	
	Возврат регистрироватьПриЗаписи;
	
КонецФункции

#КонецОбласти // ПереопределяемыйОбработчикомИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс