
&НаКлиенте
Процедура ОбработкаКоманды(пДанныеЗаполненияМассив, ПараметрыВыполненияКоманды)
	
	ОбработкаКомандыСервер(пДанныеЗаполненияМассив);

	// @TODO 250708 Заяш: Проверить все места исползования
	Оповестить("ВходящиеСообщения_ИзмененыСтатусы");

КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыСервер(пПакетыДанных)
	
	Если пПакетыДанных.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;
	
	обработчик = Обработки.обм_ПакетыДанных_Обработка.Создать();
	обработчик.ПакетыДанных_Обработать(пПакетыДанных);
	
КонецПроцедуры
