&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура КОтправке(Команда) 
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
		
	КонецЕсли; 

	источникСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
	версияДанных = Элементы.Список.ТекущиеДанные.ВерсияДанных;
	узелОтправительИсточника = Элементы.Список.ТекущиеДанные.УзелОтправитель;
	удалитьРегистрацию = Команда.Имя <> "АдресацияКОтправкеБезУдаленияРегистрации";
	КОтправкеНаСервере(источникСсылка, версияДанных, узелОтправительИсточника, удалитьРегистрацию);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура КОтправкеНаСервере(пИсточникСсылка, пВерсияДанных, пУзелОтправительИсточника, пУдалитьРегистрацию)
	
	РегистрыСведений.обм_Измененные.КОтправке(
		пИсточникСсылка, пВерсияДанных, пУзелОтправительИсточника, пУдалитьРегистрацию);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогом()
	
	Если Элементы.Список.Видимость Тогда
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
	Если Элементы.ФормаПереключитьРегламентное.Видимость Тогда
		регламентное = Регламентное_Найти();
		
		заголовокКнопки = Неопределено;
		картинкаКнопки = Неопределено;
		Если регламентное.Использование Тогда
			заголовокКнопки = "Задание работает";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругЗеленый;
			
		ИначеЕсли Не регламентное.Использование Тогда
			заголовокКнопки = "Задание отключено";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругПустой;
			
		КонецЕсли;

		Элементы.ФормаПереключитьРегламентное.Заголовок = заголовокКнопки;
		Элементы.ФормаПереключитьРегламентное.Картинка = картинкаКнопки;
					
	КонецЕсли; 		

КонецПроцедуры

&НаСервере
Процедура ПереключитьРегламентноеНаСервере()
	
	регламентное = Регламентное_Найти();
	
	использование = регламентное.Использование;
	
	регламентное.Использование = Не использование;
	регламентное.Записать();
	
	УправлениеДиалогом();

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРегламентное(Команда)
	
	ПереключитьРегламентноеНаСервере();
	
КонецПроцедуры 

&НаСервере
Функция Регламентное_Найти()
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.обм_Отправка_1_ИсходящиеСообщения_Создать);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокОбработчиков(Команда)
	
	ОткрытьФорму("Справочник.общ_Обработчики.ФормаСписка");
	
КонецПроцедуры
