
&НаКлиенте
Процедура ОбработкаКоманды(пДанныеЗаполненияДляСравнения, ПараметрыВыполненияКоманды)
	
	// Чтобы сравнить входящие данные, нужно как минимум два объекта
	Если пДанныеЗаполненияДляСравнения.Количество() < 2 Тогда
		
		СообщПольз = Новый СообщениеПользователю;
		СообщПольз.Текст = "Для сравнения необходимо выбрать два объекта";
		СообщПольз.Сообщить();
		
		Возврат;
		
	КонецЕсли; 

	ПараметрыОткрытия = Новый Структура;
	
	Заголовок = "Сравнение текстов приемников: ";
	Для сч = 0 по 1 Цикл
		СсылкаДляСравнения = пДанныеЗаполненияДляСравнения[сч];
		Приемник_JSON = ПолучитьПриемник_JSON(СсылкаДляСравнения);
		
		Порядок = сч + 1;
		ПараметрыОткрытия.Вставить("Текст" + Порядок, Приемник_JSON);
		Заголовок = Заголовок + Порядок + "-" + Строка(СсылкаДляСравнения) 
		
	КонецЦикла;
	сч = Неопределено;
	
	ПараметрыОткрытия.Вставить("ЗаголовокФормы", Заголовок);
	
	ОткрытьФорму(
		"Обработка.общ_КонсольКода.Форма.общ", 
		ПараметрыОткрытия, 
		, // Форма владелец 
		Новый УникальныйИдентификатор, // УникальныйИдентификатор, 
		, // Окно
		, // Навигационная ссылка
		, // ОповещениеОЗакрытии,
		  // РежимОткрытияОкнаФормы.БлокироватьОкноВладельца// РежимОткрытияОкна
		);

КонецПроцедуры

&НаСервере
Функция ПолучитьПриемник_JSON(пДанныеЗаполения)
	
	Возврат пДанныеЗаполения.Приемник_JSON;
	
КонецФункции