
&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПутьНаСервере(пПутьПапкиДляОтладкиОбработчиков)
	
	Справочники.общ_Обработчики.Отладка_ВключитьВЭтомСеансе(пПутьПапкиДляОтладкиОбработчиков);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПуть(Команда)
	УстановитьПутьНаСервере(ПутьПапкиДляОтладкиОбработчиков);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПутьПапкиДляОтладкиОбработчиков = Справочники.общ_Обработчики.Отладка_ПапкаДляОтладкиОбработчиков();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПутьПапкиДляОтладкиОбработчиковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	диалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	диалогВыбораПапки.МножественныйВыбор = Ложь;
	ожиданиеВыбора = диалогВыбораПапки.ВыбратьАсинх();
	выбранныеПапки = Ждать ожиданиеВыбора;
	
	Если ТипЗнч(выбранныеПапки) <> Тип("Массив") Тогда
		Возврат;
		
	КонецЕсли;
	
	Для Каждого путьПапки Из выбранныеПапки Цикл
		Если ПустаяСтрока(путьПапки) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьПапкиДляОтладкиОбработчиков = путьПапки;
		
		Прервать;
		
	КонецЦикла;
	путьПапки = Неопределено;

КонецПроцедуры
