#Область ПрограммныйИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_ИнтерфейсОбработчиков_ПакетыДанных_Обработка Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПереопределяемыйИнтерфейс

// Функция заполнения объекта-приемника данными заполнения
//
// Параметры:
//  пПриемникСсылка - ЛюбаяСсылка или Неопределено	 
//		- Ссылка на приемник, если он уже существует, иначе неопределено
//  пПакетДанных - СправочникСсылка.обм_ПакетыДанных
//		- Объект входящего запроса, содержащий данные для заполнения приемника 
//  ЗаписыватьПриемника	- Булево	 
//		- записать объект сразу при обработке
// 
// Возвращаемое значение:
// СсылочныйОбъект или Неопределено  - Заполненный объект при успехе обработки или неопределено при неудаче
//
Функция ПакетДанных_Обработать(пПакетДанных) Экспорт
	
	ответПоУмолчанию = Неопределено;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = Неопределено Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	// Проверка годности параметров
	Если Не общ.ЭтоЗаполненнаяСсылка(пПакетДанных, Тип("СправочникСсылка.обм_ПакетыДанных")) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	приемникОбъект = РеализацияИнтерфейса.ПакетДанных_Обработать(пПакетДанных);
	
	// Проверка приемника
	ОбъектСсылкаДругое = общ.ОбъектСсылкаДругое(приемникОбъект);

	Если ОбъектСсылкаДругое = "Объект" Тогда
			// ОК
			
	ИначеЕсли приемникОбъект = Неопределено Тогда
			// ОК
			
	Иначе
		комментОшибки = 
			СтрШаблон(
				"Обработчик заполнения приемника должен вернуть объект БД или 'Неопределено'
				|Возвращенное значение: '%1' типа '%2'
				|Объект входящего запроса: %3",
				приемникОбъект, // %1
				ТипЗнч(приемникОбъект), // %2
				пПакетДанных
				);
						
		ВызватьИсключение комментОшибки;
			
	КонецЕсли;

	Возврат приемникОбъект;
	
КонецФункции

#КонецОбласти // ПереопределяемыйИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс
