
&НаКлиенте
Процедура ОбработкаКоманды(пПакетДанныхДляСравнения, пПараметрыВыполненияКоманды)
	
	// Чтобы сравнить входящие данные, нужно как минимум два объекта
	Если пПакетДанныхДляСравнения.Количество() < 2 Тогда
		
		СообщПольз = Новый СообщениеПользователю;
		СообщПольз.Текст = "Для сравнения необходимо выбрать два объекта";
		СообщПольз.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	
	Заголовок = "Сравнение входящих данных: ";
	Для сч = 0 по 1 Цикл
		СсылкаДляСравнения = пПакетДанныхДляСравнения[сч];
		стрДанные = ДанныеОтСервера(СсылкаДляСравнения);
		
		Порядок = сч + 1;
		ПараметрыОткрытия.Вставить("Текст" + Порядок, стрДанные);
		Заголовок = Заголовок + Порядок + "-" + Строка(СсылкаДляСравнения) 
		
	КонецЦикла;
	сч = Неопределено;
	
	ПараметрыОткрытия.Вставить("ЗаголовокФормы", Заголовок);
	
	ОткрытьФорму(
		"Обработка.общ_КонсольКода.Форма.общ", 
		ПараметрыОткрытия, 
		, // Форма владелец 
		Новый УникальныйИдентификатор, // УникальныйИдентификатор, 
		, // Окно
		, // Навигационная ссылка
		, // ОповещениеОЗакрытии,
		  // РежимОткрытияОкнаФормы.БлокироватьОкноВладельца// РежимОткрытияОкна
		);
	
КонецПроцедуры

&НаСервере
Функция ДанныеОтСервера(пПакетДанных)
	
	Возврат общ.ЗначениеРеквизитаОбъекта(пПакетДанных, "Данные", Истина);
	
КонецФункции