#Область ПрограммныйИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_ПакетыДанных_Обработка_ПереопределяемыйИнтерфейс Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПереопределяемыйИнтерфейс

// Функция заполнения объекта-приемника данными заполнения
//
// Параметры:
//  пПриемникСсылка - ЛюбаяСсылка или Неопределено	 
//		- Ссылка на приемник, если он уже существует, иначе неопределено
//  пПакетДанных - СправочникСсылка.обм_ПакетыДанных
//		- Объект входящего запроса, содержащий данные для заполнения приемника 
//  ЗаписыватьПриемника	- Булево	 
//		- записать объект сразу при обработке
// 
// Возвращаемое значение:
// СсылочныйОбъект или Неопределено  - Заполненный объект при успехе обработки или неопределено при неудаче
//
Функция ПакетыДанных_Обработать(пПакетДанных) Экспорт
	
	ответПоУмолчанию = Неопределено;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = Неопределено Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	// Проверка годности параметров
	Если Не общ.ЭтоЗаполненнаяСсылка(пПакетДанных, Тип("СправочникСсылка.обм_ПакетыДанных")) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	приемникиОбъекты = РеализацияИнтерфейса.ПакетыДанных_Обработать(пПакетДанных);
	
	Для Каждого приемник Из приемникиОбъекты Цикл

		// Проверка приемника
		ОбъектСсылкаДругое = общ.ОбъектСсылкаДругое(приемникиОбъекты);

		Если ОбъектСсылкаДругое = "Объект" Тогда
			// ОК
			
		ИначеЕсли приемникиОбъекты = Неопределено Тогда
			// ОК
			
		Иначе
			стрОбОшибкеНеверныйТипВозвращенногоПараметра = 
				СтрШаблон(
					"Обработчик заполнения приемника должен вернуть объект БД или 'Неопределено'
					|Возвращенное значение: '%1' типа '%2'
					|Объект входящего запроса: %3",
					приемникиОбъекты, // %1
					ТипЗнч(приемникиОбъекты), // %2
					пПакетДанных
					);
						
			ВызватьИсключение стрОбОшибкеНеверныйТипВозвращенногоПараметра;
			
		КонецЕсли;
		
	КонецЦикла;
	приемник = Неопределено;

	Возврат приемникиОбъекты;
	
КонецФункции

#КонецОбласти // ПереопределяемыйИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс
