// @TODO 250705 Заяш: Удалить
Функция ВыполнитьОбработчик(Знач пОбработчик, Знач пИсточник, пПараметры = Неопределено) Экспорт 
	
	общ.Проверка_Тип(пОбработчик, "СправочникСсылка.общ_Обработчики, Строка");
	 
	Если ТипЗнч(пОбработчик) = Тип("Строка") Тогда
		пОбработчик = Справочники.общ_Обработчики[пОбработчик];
		
	КонецЕсли;
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пОбработчик, тип("СправочникСсылка.общ_Обработчики")) Тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
	результат = Справочники.общ_Обработчики.ВыполнитьОбработчик(пОбработчик, пИсточник, пПараметры); 
	
	Если ТипЗнч(результат) = Тип("ИнформацияОбОшибке") Тогда
		стрОбОшибке = 
			СтрШаблон(
				"Ошибка при выполнении обработчика '%1' для объекта '%2' (типа %3)
				|%4
				|
				|По причине:
				|%5",
				пОбработчик, // %1
				пИсточник, // %2
				ТипЗнч(пИсточник), // %3
				общ.НавигационнаяСсылка(пИсточник), // %4
				общ.Ошибка_ПодробноеПредставление(результат) // %5
				);
			
		ВызватьИсключение стрОбОшибке;
		
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции

