
&НаКлиенте
Асинх Процедура ОбработкаКоманды(пДанныеЗаполенияМассив, пПараметрыВыполненияКоманды)
	
	Статус = Неопределено;
	ОжиданиеВвода = ВвестиЗначениеАсинх(Статус, "Выберите статус", Тип("ПеречислениеСсылка.обм_ВходящиеСообщения_Статусы"));
	
	Статус = Ждать ОжиданиеВвода;
	
	Если Статус = Неопределено Тогда 
		Возврат;
		
	КонецЕсли;
	
	ОбработкаКоманды_Сервер(пДанныеЗаполенияМассив, Статус);

КонецПроцедуры

&НаСервере
Процедура ОбработкаКоманды_Сервер(пДанныеЗаполненияМассив, пСтатус)
	
	Если	ТипЗнч(пСтатус) <> Тип("ПеречислениеСсылка.обм_ВходящиеСообщения_Статусы") 
		ИЛИ Не ЗначениеЗаполнено(пСтатус)
	Тогда
		Возврат;
		
	КонецЕсли;

	Для Каждого данныеЗаполненияСсылка Из пДанныеЗаполненияМассив Цикл
		Справочники.обм_ВходящиеСообщения.Статус_Установить( // Ручная установка
			данныеЗаполненияСсылка, 
			пСтатус, 
			"Статус установлен вручную" // Примечание
			);
		
	КонецЦикла;
	данныеЗаполненияСсылка = Неопределено;
	
КонецПроцедуры
