#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_ИнтерфейсОбработчиков_ОбъектыИБ Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПереопределяемыйОбработчикомИнтерфейс

Функция ОбъектИБ_ПодлежитОтправке(пСсылкаИБ) Экспорт
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаИБ) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = Неопределено Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	регистрироватьПриЗаписи = РеализацияИнтерфейса.ОбъектИБ_ПодлежитОтправке(пСсылкаИБ);
		
	Если ТипЗнч(регистрироватьПриЗаписи) <> Тип("Булево") Тогда
		регистрироватьПриЗаписи = Ложь;
		
	КонецЕсли;
	
	Возврат регистрироватьПриЗаписи;
	
КонецФункции

Функция ОбъектИБ_ПодлежитОтправкеПослеОбменДаннымиЗагрузка(пСсылкаИБ, пУзелОтправитель = Неопределено) Экспорт
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаИБ) Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = Неопределено Тогда
		Возврат Ложь;
		
	КонецЕсли;
	
	узел = обм.УзелПривести(пУзелОтправитель);
	регистрировать = РеализацияИнтерфейса.ОбъектИБ_ПодлежитОтправкеПослеОбменДаннымиЗагрузка(пСсылкаИБ, узел);
		
	Если ТипЗнч(регистрировать) <> Тип("Булево") Тогда
		регистрировать = Ложь;
		
	КонецЕсли;
	
	Возврат регистрировать;
	
КонецФункции

#КонецОбласти // ПереопределяемыйОбработчикомИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли	// Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение