&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна(Метаданные.Роли.общ_ПолныеПрава) Тогда
		Параметры.Свойство("ОбъектОснование", ОбъектОснование);
	Иначе	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеОбъекта_РедакторОбъектаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ОбъектОснование", ОбъектОснование);
	пФормаОтчета = ПолучитьФорму("Обработка.РасширениеОбъекта_AltZ_РедакторОбъекта.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор); 
	пФормаОтчета.Открыть();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеОбъекта_ПраваДоступаНажатие(Элемент)
	
	ОбъектМетаданных = НайтиОбъектМетаданных();
	
	Если Не ЗначениеЗаполнено(ОбъектМетаданных) Тогда
		ПоказатьПредупреждение(Неопределено, "Анализ прав для данного типа объекта не поддерживается", 10, "ВНИМАНИЕ");
		Закрыть();
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("ОбъектМетаданных", ОбъектМетаданных);
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	
	пФормаОтчета = ПолучитьФорму("Отчет.РасширениеОбъекта_AltZ_ПраваДоступа.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор); 
	пФормаОтчета.Заголовок = "Расширение объекта: Права доступа " + ОбъектОснование;
	пФормаОтчета.Открыть();
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция НайтиОбъектМетаданных()
	
	ПолноеИмя = ОбъектОснование.Метаданные().ПолноеИмя();
	
	Возврат Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ПолноеИмя);	
	
КонецФункции

&НаКлиенте
Процедура РасширениеОбъекта_ПоискСсылокНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ОбъектОснование", ОбъектОснование);
	пФормаОтчета = ПолучитьФорму("Обработка.РасширениеОбъекта_AltZ_ПоискСсылок.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор); 
	пФормаОтчета.Открыть();

	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеОбъекта_СторноДокументаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ОбъектОснование", ОбъектОснование);
	пФормаОтчета = ПолучитьФорму("Обработка.РасширениеОбъекта_AltZ_СторноДокумента.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор); 
	пФормаОтчета.Открыть();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеОбъекта_ВыгрузкаЗагрузкаДанныхXMLНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ОбъектОснование", ОбъектОснование);
	пФормаОтчета = ПолучитьФорму("Обработка.РасширениеОбъекта_AltZ_ВыгрузкаЗагрузкаДанныхXML.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор); 
	пФормаОтчета.Открыть();
	
	Закрыть();
	
КонецПроцедуры
