#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаОтладкиОбработчиков(Команда)
	ОткрытьФорму("Справочник.общ_Обработчики.Форма.НастройкаОтладкиОбработчиков");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзФайла(Команда)
	
	параметрыОткрытия = Новый Структура;
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		параметрыОткрытия.Вставить("Ключ", Элементы.Список.ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
	параметрыОткрытия.Вставить(обм_лит.Ключ_ЗагрузитьИзФайлаПриОткрытии(), Истина);
	
	ОткрытьФорму("Справочник.общ_Обработчики.ФормаОбъекта", параметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
