#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаОтладкиОбработчиков(Команда)
	ОткрытьФорму("Справочник.общ_Обработчики.Форма.НастройкаОтладкиОбработчиков");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзФайла(Команда)
	
	параметрыОткрытия = Новый Структура;
	параметрыОткрытия.Вставить(обм_лит.Ключ_ЗагрузитьИзФайлаПриОткрытии(), Истина);
	
	ОткрытьФорму("Справочник.общ_Обработчики.ФормаОбъекта", параметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
