
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого строкаДинСписка Из Строки Цикл
		последнийПриемник = строкаДинСписка.Значение.Данные.ПоследнийПриемник; 
		Если ПустаяСтрока(последнийПриемник) Тогда
			Продолжить;
			
		КонецЕсли;
		
		последнийПриемникСсылка = ЗначениеИзСтрокиВнутр(последнийПриемник);
		
		оформлениеПП = строкаДинСписка.Значение.Оформление.Получить("ПоследнийПриемник");
		
		Если оформлениеПП = Неопределено Тогда
			Продолжить;
			
		КонецЕсли;
		
		оформлениеПП.УстановитьЗначениеПараметра("Текст", Строка(последнийПриемникСсылка));
		
	КонецЦикла;
	строкаДинСписка = Неопределено;
	
КонецПроцедуры
