
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого строкаДинСписка Из Строки Цикл
		Если ПустаяСтрока(строкаДинСписка.ПоследнийПриемник) Тогда
			Возврат;
			
		КонецЕсли;
		
		последнийПриемникСсылка = ЗначениеИзСтрокиВнутр(строкаДинСписка.ПоследнийПриемник);
		
		оформлениеПП = строкаДинСписка.Оформление.ПоследнийПриемник;
		оформлениеПП.УстановитьЗначениеПараметра("Текст", Строка(последнийПриемникСсылка));
		
	КонецЦикла;
	строкаДинСписка = Неопределено;
	
КонецПроцедуры
