
Процедура ПередЗаписью(Отказ, Замещение)
	
	// Регистр не предназначен для обмена, он сам часть подсистемы обмена
	// Поэтому записывать в режиме ОбменДанными.Загрузка
	// Чтобы не срабатывали сторонние подписки и не вызывали задержку
	ЭтотОбъект.ОбменДанными.Загрузка = Истина;
	
	Для Каждого запись Из ЭтотОбъект Цикл
		// Это справочное поле на форме списка
		запись.ПредставлениеТипаПриемника = Строка(ТипЗнч(запись.Приемник));
		
	КонецЦикла;
	запись = Неопределено;
	
КонецПроцедуры
