&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	пАктивноеОкно = АктивноеОкно();
	Если пАктивноеОкно = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Источник = Неопределено;
	
	Попытка
		Форма = пАктивноеОкно.Содержимое[0];
		пИмяФормы = Форма.ИмяФормы; 
		Если Найти(пИмяФормы, "Форма.ФормаДокумента") > 0 Тогда
			Источник = Форма.Объект.Ссылка;
		ИначеЕсли Найти(пИмяФормы, "Форма.ФормаЭлемента") > 0 Тогда
			Если Найти(пИмяФормы, "Справочник.ФизическиеЛица") > 0 Тогда 
				Источник = Форма.ФизическоеЛицо.Ссылка;	
			ИначеЕсли Найти(пИмяФормы, "Справочник.Сотрудники") > 0 Тогда
				Источник = Форма.Сотрудник.Ссылка;
			Иначе
				Источник = Форма.Объект.Ссылка;	
			КонецЕсли;  
		ИначеЕсли Найти(пИмяФормы, "Форма.ФормаСчета") > 0 Тогда
			Источник = Форма.Объект.Ссылка;	 
		ИначеЕсли Найти(пИмяФормы, "Форма.ФормаЗадачи") > 0 Тогда
			Источник = Форма.Объект.Ссылка;	
		ИначеЕсли Найти(пИмяФормы, "Документ.Ввод") > 0
			И Найти(пИмяФормы, "Форма.ФормаСписка") = 0
			И Найти(пИмяФормы, "Форма.ФормаВыбора") = 0 Тогда
			Источник = Форма.Объект.Ссылка;	
		Иначе
			Попытка
				Если ТипЗнч(Форма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
					Источник = Форма.ТекущийЭлемент.ТекущаяСтрока;
					
					//переопределим Источник, когда основная таблица не указана
					Если ТипЗнч(Источник) = Тип("Число") Тогда
						Источник = Форма.ТекущийЭлемент.ДанныеСтроки(Источник).Ссылка;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОбъектОснование", Источник);

	ОткрытьФорму("ОбщаяФорма.обм_ПанельКоманд",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры 