&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	пАктивноеОкно = АктивноеОкно();
	Если пАктивноеОкно = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Источник = Неопределено;
	
	Попытка
		Форма = пАктивноеОкно.Содержимое[0];
		пИмяФормы = Форма.ИмяФормы;
		Если Найти(пИмяФормы, "Форма.ФормаДокумента") > 0 Тогда
			Источник = Форма.Объект.Ссылка;
		ИначеЕсли Найти(пИмяФормы, "Форма.ФормаЭлемента") > 0 Тогда
			Источник = Форма.Объект.Ссылка;
		ИначеЕсли Найти(пИмяФормы, "Форма.ФормаСчета") > 0 Тогда
			Источник = Форма.Объект.Ссылка;
		ИначеЕсли Найти(пИмяФормы, "Форма.ФормаЗадачи") > 0 Тогда
			Источник = Форма.Объект.Ссылка;
		ИначеЕсли ТипЗнч(Форма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			Источник = Форма.ТекущийЭлемент.ТекущаяСтрока;
			//переопределим Источник, когда основная таблица не указана
			Если ТипЗнч(Источник) = Тип("Число") Тогда
				Источник = Форма.ТекущийЭлемент.ДанныеСтроки(Источник).Ссылка;
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Тут допустимо скрывать ошибку, т.к. команда универсальная и может не определить источник
		Возврат;
		
	КонецПопытки;
	
	Если Источник = Неопределено Тогда
		Возврат;
		
	КонецЕсли;
	
	параметрыФормы = Новый Структура("ОбъектОснование", Источник);
	
	ОткрытьФорму("ОбщаяФорма.обм_ПанельКоманд",
			параметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
