
&НаКлиенте
Асинх Процедура ОбработкаКоманды(пПакетыДанных, пПараметрыВыполненияКоманды)
	
	Статус = Неопределено;
	ОжиданиеВвода = ВвестиЗначениеАсинх(Статус, "Выберите статус", Тип("ПеречислениеСсылка.обм_ВходящиеСообщения_Статусы"));
	
	Статус = Ждать ОжиданиеВвода;
	
	Если Статус = Неопределено Тогда 
		Возврат;
		
	КонецЕсли;
	
	ОбработкаКоманды_Сервер(пПакетыДанных, Статус);
	
	Оповестить(обм_лит.ВходящиеСообщения_ИзмененыСтатусы());

КонецПроцедуры

&НаСервере
Процедура ОбработкаКоманды_Сервер(пПакетыДанных, пСтатус)
	
	Если	ТипЗнч(пСтатус) <> Тип("ПеречислениеСсылка.обм_ВходящиеСообщения_Статусы") 
		ИЛИ Не ЗначениеЗаполнено(пСтатус)
	Тогда
		Возврат;
		
	КонецЕсли;

	Для Каждого пакетСсылка Из пПакетыДанных Цикл
		Справочники.обм_ВходящиеСообщения.Статус_Установить( // Ручная установка
			пакетСсылка, 
			пСтатус, 
			"Статус установлен вручную" // Примечание
			);
		
	КонецЦикла;
	пакетСсылка = Неопределено;
	
КонецПроцедуры
