#Область ПрограммныйИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_Интерфейс_ОбработкаВходящихСообщений Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПереопределяемыйИнтерфейс

Функция ВходящееСообщение_Обрабатывается(пВходящееСообщениеСсылка) Экспорт
	
	ответПоУмолчанию = Ложь;
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = ЭтотОбъект Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	// Проверка годности параметров
	Если Не общ.ЭтоЗаполненнаяСсылка(пВходящееСообщениеСсылка, Тип("СправочникСсылка.обм_ВходящиеСообщения")) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	сообщениеОбрабатывается = РеализацияИнтерфейса.ВходящееСообщение_Обрабатывается(пВходящееСообщениеСсылка);
			
	Если ТипЗнч(сообщениеОбрабатывается) <> Тип("Булево") Тогда
		сообщениеОбрабатывается = ответПоУмолчанию;
		
	КонецЕсли;
	
	Возврат сообщениеОбрабатывается;
	
КонецФункции

Функция ПакетыДанных_Извлечь(пВходящееСообщениеСсылка, пПримечаниеНаВозврат = "") Экспорт
	
	ответПоУмолчанию = "Не обрабатывается";
	
	// Значение по умолчанию
	Если РеализацияИнтерфейса = ЭтотОбъект Тогда
		пПримечаниеНаВозврат = ответПоУмолчанию;
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Проверка годности параметров
	Если Не общ.ЭтоЗаполненнаяСсылка(пВходящееСообщениеСсылка, Тип("СправочникСсылка.обм_ВходящиеСообщения")) Тогда
		пПримечаниеНаВозврат = ответПоУмолчанию;
		Возврат Неопределено;
		
	КонецЕсли;
	
	объектыПакетовДанных = РеализацияИнтерфейса.ПакетыДанных_Извлечь(пВходящееСообщениеСсылка, пПримечаниеНаВозврат);
	пПримечаниеНаВозврат = СокрЛП(пПримечаниеНаВозврат);
	
	Если ТипЗнч(объектыПакетовДанных) = Тип("СправочникОбъект.обм_ПакетыДанных") Тогда
		промежуточныйМассив = Новый Массив;
		промежуточныйМассив.Добавить(объектыПакетовДанных);
		объектыПакетовДанных = промежуточныйМассив;
		
	КонецЕсли;
	
	Если ТипЗнч(объектыПакетовДанных) <> Тип("Массив") Тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Проверить данные заполнения, годные переложить в другой массив
	годныеОбъекты = Новый Массив;
	Для Каждого пакетДанныхОбъект Из объектыПакетовДанных Цикл
		Если ТипЗнч(пакетДанныхОбъект) <> Тип("СправочникОбъект.обм_ПакетыДанных") Тогда
			Продолжить;
			
		КонецЕсли;
		
		годныеОбъекты.Добавить(пакетДанныхОбъект);
		
	КонецЦикла;
	пакетДанныхОбъект = Неопределено;

	Возврат годныеОбъекты;
	
КонецФункции 

#КонецОбласти // ПереопределяемыйИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс