#Область ПрограммныйИнтерфейс

Процедура ПакетыДанных_ОбновитьПриемники(пПакетыДанных) Экспорт
	
	Справочники.обм_ПакетыДанных.ОбновитьПриемники(пПакетыДанных);
	
КонецПроцедуры

Функция Приемники_ОбновитьПоследнимПакетомДанных(пСсылкиПриемников) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приемники", пСсылкиПриемников);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоследнееЗаполнение.Приемник КАК Приемник,
	|	ПоследнееЗаполнение.ПакетДанных КАК ПакетДанных,
	|	ПоследнееЗаполнение.ПакетДанных.Обработчик КАК Обработчик
	|ИЗ
	|	РегистрСведений.обм_Приемники_ЗагруженныеПакетыДанных.СрезПоследних(, Приемник В (&Приемники)) КАК ПоследнееЗаполнение";
	
	выборка = Запрос.Выполнить().Выбрать();
	
	заполненныеПриемники = Новый Массив;
	
	загрузчик = Обработки.обм_ПакетыДанных_Обработка.Создать();
	Пока выборка.Следующий() Цикл
		приемникОбъект = загрузчик.Приемник_Заполнить(выборка.Приемник, выборка.ПакетДанных, выборка.Обработчик);
		
		объектСсылкаДругое = общ.ОбъектСсылкаДругое(приемникОбъект);
		
		Если объектСсылкаДругое = "Объект" Тогда
			заполненныеПриемники.Добавить(приемникОбъект.Ссылка); 
			
		ИначеЕсли объектСсылкаДругое = "Ссылка" Тогда
			заполненныеПриемники.Добавить(приемникОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	выборка.Сбросить();

	Возврат заполненныеПриемники;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс