#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Связать(пПриемник, пПакетДанных) Экспорт
	Если Не общ.ЭтоЗаполненнаяСсылка(пПриемник) Тогда
		Возврат;
		
	КонецЕсли; 
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пПакетДанных, Тип("СправочникСсылка.обм_ПакетыДанных")) Или Не общ.Ссылка_Существует(пПакетДанных) Тогда
		Возврат;
		
	КонецЕсли;
	
	запись = РегистрыСведений.обм_Приемники_ЗагруженныеПакетыДанных.СоздатьМенеджерЗаписи();
	запись.Приемник = пПриемник;
	запись.ПакетДанных = пПакетДанных;
	запись.Период = общ.ДатаУниверсальная();
	запись.Записать(); 
	
КонецПроцедуры
	
#КонецЕсли // #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

