&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	пАктивноеОкно = АктивноеОкно();
	
	текущаяФорма = Неопределено;
	Если ТипЗнч(пАктивноеОкно) = Тип("ОкноКлиентскогоПриложения") И пАктивноеОкно.Содержимое.Количество() Тогда
		текущаяФорма = пАктивноеОкно.Содержимое[0];
		
	КонецЕсли;
	
	сборщик = Новый Структура("ИмяФормы, Объект, ТекущийЭлемент");
	
	Если текущаяФорма <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(сборщик, текущаяФорма);
		
	КонецЕсли;
	
	параметрыИсточника = Новый Структура;
	параметрыИсточника.Вставить("ИмяФормы", сборщик.ИмяФормы);
	
	выделенныеСтроки = Неопределено;
	Если ТипЗнч(сборщик.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		выделенныеСтроки = текущаяФорма.ТекущийЭлемент.ВыделенныеСтроки;
		
	КонецЕсли;
	
	параметрыИсточника.Вставить("ВыделенныеСтроки", выделенныеСтроки);
	параметрыИсточника.Вставить("Источник", ИсточникИзКонтекста(сборщик, текущаяФорма));
	
	обм_командыКлиент.ПанельКоманд_ПараметрыВыполнения_Установить(ПараметрыВыполненияКоманды);
	
	ОткрытьФорму("ОбщаяФорма.обм_ПанельКоманд",
			параметрыИсточника,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка,
			,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Функция ИсточникИзКонтекста(сборщик, текущаяФорма)
	
	Если ТипЗнч(сборщик.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		таблица = текущаяФорма.ТекущийЭлемент;
		текСтрокаТаблицы = таблица.ТекущаяСтрока;
		данныеСтроки = Неопределено;
		Если текСтрокаТаблицы <> Неопределено Тогда
			данныеСтроки = таблица.ДанныеСтроки(текСтрокаТаблицы);
			
		КонецЕсли;
		
		Если данныеСтроки <> Неопределено
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(данныеСтроки, "Ссылка")
			И общ.ЭтоЗаполненнаяСсылка(данныеСтроки.Ссылка) Тогда
			Возврат данныеСтроки.Ссылка;
			
		КонецЕсли;
		
		Если общ.ЭтоЗаполненнаяСсылка(текСтрокаТаблицы) Тогда
			Возврат текСтрокаТаблицы;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если сборщик.Объект <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(сборщик.Объект, "Ссылка")
		И общ.ЭтоЗаполненнаяСсылка(сборщик.Объект.Ссылка) Тогда
		Возврат сборщик.Объект.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
