&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПослание(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
		
	КонецЕсли;
	
	// @TODO 250717 Заяш: переписать вызов на другой набор параметров
	// @TODO 250717 Заяш: надо изменить интерфейс формы
	результат =
		ОтправитьПосланиеНаСервере(
			Элементы.Список.ТекущиеДанные.Узел,
			Элементы.Список.ТекущиеДанные.Категория,
			Элементы.Список.ТекущиеДанные.Идентификатор,
			Ложь // Удалить регистрацию
			);
			
	Если Не ПустаяСтрока(результат) Тогда
		сообщ = Новый СообщениеПользователю;
		сообщ.Текст = результат;
		сообщ.Сообщить();

	КонецЕсли; 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОтправитьПосланиеИУдалитьРегистрацию(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
		
	КонецЕсли;
	
	// @TODO 250717 Заяш: переписать вызов на другой набор параметров
	// @TODO 250717 Заяш: надо изменить интерфейс формы
	результат =
		ОтправитьПосланиеНаСервере(
			Элементы.Список.ТекущиеДанные.Узел,
			Элементы.Список.ТекущиеДанные.Категория,
			Элементы.Список.ТекущиеДанные.Идентификатор,
			Истина // Удалить регистрацию
			);
			
	Если Не ПустаяСтрока(результат) Тогда
		сообщ = Новый СообщениеПользователю;
		сообщ.Текст = результат;
		сообщ.Сообщить();

	КонецЕсли; 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ОтправитьПосланиеНаСервере(пИсходящееСообщение, пУзел, пОбработчик, пУдалитьРегистрацию)
	
	результат = РегистрыСведений.обм_КОтправке.ИсходящееСообщение_Отправить(пИсходящееСообщение, пУзел, пОбработчик, пУдалитьРегистрацию);
	
	Возврат результат;
	
КонецФункции

&НаСервере
Процедура УправлениеДиалогом()
	
	Если Элементы.Список.Видимость Тогда
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
	Если Элементы.ФормаПереключитьРегламентное.Видимость Тогда
		регламентное = Регламентное_Найти();
		
		заголовокКнопки = Неопределено;
		картинкаКнопки = Неопределено;
		Если регламентное.Использование Тогда
			заголовокКнопки = "Задание работает";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругЗеленый;
			
		ИначеЕсли Не регламентное.Использование Тогда
			заголовокКнопки = "Задание отключено";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругПустой;
			
		КонецЕсли;

		Элементы.ФормаПереключитьРегламентное.Заголовок = заголовокКнопки;
		Элементы.ФормаПереключитьРегламентное.Картинка = картинкаКнопки;
					
	КонецЕсли; 		

КонецПроцедуры

&НаСервере
Процедура ПереключитьРегламентноеНаСервере()
	
	регламентное = Регламентное_Найти();
	
	использование = регламентное.Использование;
	
	регламентное.Использование = Не использование;
	регламентное.Записать();
	
	УправлениеДиалогом();

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРегламентное(Команда)
	
	ПереключитьРегламентноеНаСервере();
	
КонецПроцедуры 

&НаСервере
Функция Регламентное_Найти()
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.обм_Отправка_ИсходящиеСообщения_Отправить);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокОбработчиков(Команда)
	
	ОткрытьФорму("Справочник.общ_Обработчики.ФормаСписка");
	
КонецПроцедуры

