#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеДиалогом();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗапросом(Команда)
	
	текстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Ссылка ИЗ ";
	оповещениеОВводе = Новый ОписаниеОповещения("ДобавитьЗапросом_ЗавершениеВводаТекстаЗапроса", ЭтотОбъект);
	ПоказатьВводЗначения(оповещениеОВводе, текстЗапроса, "Введите текст запроса", Тип("Строка"));
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьЗапросом_ЗавершениеВводаТекстаЗапроса(пТекстЗапроса, ДопПараметры = Неопределено) Экспорт
	
	Если ПустаяСтрока(пТекстЗапроса) Тогда
		Возврат;
		
	КонецЕсли;

	ДобавитьЗапросомНаСервере(пТекстЗапроса);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ДобавитьЗапросомНаСервере(пТекстЗапроса)
	
	запрос = Новый Запрос;
	запрос.Текст = пТекстЗапроса;
	выборка = Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		Справочники.обм_ИсходящиеСообщения.СоздатьПоСсылкеИсточника(выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПослание(Команда)
	
	ключиРегистра = Элементы.Список.ВыделенныеСтроки; 
	
	Если ключиРегистра.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;

	ОтправитьПосланиеНаСервере(ключиРегистра);
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПосланиеИУдалитьРегистрацию(Команда)
	
	ключиРегистра = Элементы.Список.ВыделенныеСтроки; 
	
	Если ключиРегистра.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;
	
	удалитьРегистрацию = Истина;
	ОтправитьПосланиеНаСервере(ключиРегистра, удалитьРегистрацию);
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьПосланиеНаСервере(пКлючиРегистра, пУдалитьРегистрацию = Ложь)
	
	Для Каждого ключ Из пКлючиРегистра Цикл
		результат = РегистрыСведений.обм_КОтправке.ИсходящееСообщение_Отправить(ключ.ИсходящееСообщение,
				ключ.Узел, ключ.ОбработчикОтправки		);
		
		Если НЕ ПустаяСтрока(результат) Тогда
			пользователю = Новый СообщениеПользователю;
			пользователю.Текст = СокрЛП(ключ.ИсходящееСообщение) + ": " + СокрЛП(результат);
			пользователю.Сообщить();
			
		КонецЕсли;
		
		Если пУдалитьРегистрацию Тогда
			РегистрыСведений.обм_КОтправке.УдалитьРегистрацию(ключ.ИсходящееСообщение,
					ключ.Узел, ключ.ОбработчикОтправки		);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРегламентное(Команда)
	
	ПереключитьРегламентноеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьРегламентноеНаСервере()
	
	регламентное = Регламентное_Найти();
	
	использование = регламентное.Использование;
	
	регламентное.Использование = НЕ использование;
	регламентное.Записать();
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРазмерОчереди(Команда)
	
	размерОчереди = РазмерОчередиНаСервере();
	
	текстЗаголовка = СтрШаблон("%1 Размер очереди %2. Нажмите здесь чтобы пересчитать",
			Формат(ТекущаяДата(), "ДФ=HH:mm:ss"), // %1
			размерОчереди // %2
		);
	
	Элементы.ПоказатьРазмерОчереди.Заголовок = текстЗаголовка;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция РазмерОчередиНаСервере()
	
	размерОчереди = общ.ТаблицаФормыДинамическийСписок_Количество(ЭтаФорма.Элементы["Список"]);
	
	Возврат размерОчереди;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьВсеНаСервере()
	РегистрыСведений.обм_КОтправке.УдалитьВсе();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьВсеНаСервере(); 
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция Регламентное_Найти()
	
	мета = Метаданные.РегламентныеЗадания.обм_Отправка_2_ИсходящиеСообщения_Отправить;
	регламентное = РегламентныеЗадания.НайтиПредопределенное(мета);
	
	Возврат регламентное;
	
КонецФункции

&НаСервере
Процедура УправлениеДиалогом()
	
	Если Элементы.Список.Видимость Тогда
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
	Если Элементы.ФормаПереключитьРегламентное.Видимость Тогда
		регламентное = Регламентное_Найти();
		
		заголовокКнопки = Неопределено;
		картинкаКнопки = Неопределено;
		Если регламентное.Использование Тогда
			заголовокКнопки = "Задание работает";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругЗеленый;
			
		ИначеЕсли НЕ регламентное.Использование Тогда
			заголовокКнопки = "Задание отключено";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругПустой;
			
		КонецЕсли;
		
		Элементы.ФормаПереключитьРегламентное.Заголовок = заголовокКнопки;
		Элементы.ФормаПереключитьРегламентное.Картинка = картинкаКнопки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти