#Область СлужебныйПрограммныйИнтерфейс

Функция ВходящиеСообщения_ИзмененыСтатусы() Экспорт
	
	Возврат "ВходящиеСообщения_ИзмененыСтатусы";
	
КонецФункции

Функция ИмяПодсистемы() Экспорт
	
	Возврат общ_Кэш.обм_ИмяПодсистемы();
	
КонецФункции

Функция Ключ_ЗагрузитьИзФайлаПриОткрытии() Экспорт
	
	Возврат "ЗагрузитьИзФайлаПриОткрытии";
	
КонецФункции

Функция Ключ_ИдентификаторОтправителя() Экспорт
	
	Возврат "ИдентификаторОтправителя";
	
КонецФункции

Функция Ключ_КатегорияОтправителя() Экспорт
	
	Возврат "КатегорияОтправителя";
	
КонецФункции

Функция Ключ_УзелОтправитель() Экспорт
	
	Возврат "УзелОтправитель";
	
КонецФункции

Функция НетОбработчика() Экспорт
	
	Возврат "Нет обработчика";
	
КонецФункции

Функция ФорматОбмАльфа() Экспорт
	
	Возврат "обм.Альфа";
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс