#Область ПрограммныйИнтерфейс

Функция ВерсияИнтерфейса() Экспорт
	
	Возврат "250701";
	
КонецФункции

Функция РеализованИнтерфейс(пМетаданныеИнтерфейса) Экспорт
	
	Если пМетаданныеИнтерфейса = Метаданные.Обработки.обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс Тогда
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ПереопределяемыйИнтерфейс

Функция ИсходящееСообщение_Отправить(пИсходящееСсылка, пУзел) Экспорт
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен узел-получатель";
		
	КонецЕсли;
	
	общ.Проверка_Тип(пИсходящееСсылка, Тип("СправочникСсылка.обм_ИсходящиеСообщения"));
	
	Если Не ЗначениеЗаполнено(пИсходящееСсылка) Тогда
		ВызватьИсключение "Нет исходящего сообщения";
		
	КонецЕсли;
	
	РеализацияИнтерфейса.ИсходящееСообщение_Отправить(пИсходящееСсылка, пУзел);
	
КонецФункции

Функция ИсходящееСообщение_Создать(пСсылкаИсточника) Экспорт
	
	ответПоУмолчанию = Неопределено;
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылкаИсточника) Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	Попытка
		результатСоздания = РеализацияИнтерфейса.ИсходящееСообщение_Создать(пСсылкаИсточника);
		
	Исключение
		результатСоздания = Справочники.обм_ИсходящиеСообщения.СоздатьЭлемент();
		результатСоздания.ФлагОшибкиПриСоздании = Истина;
		
	КонецПопытки;
	
	Если результатСоздания = Неопределено Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	общ.Проверка_Тип(результатСоздания, "СправочникОбъект.обм_ИсходящиеСообщения, Неопределено");
	
	исходящие = Новый Массив;
	Если ТипЗнч(результатСоздания) = Тип("Массив") Тогда
		исходящие = результатСоздания;
		
	ИначеЕсли ТипЗнч(результатСоздания) = Тип("СправочникОбъект.обм_ИсходящиеСообщения") Тогда
		исходящие.Добавить(результатСоздания);
		
	КонецЕсли;
	
	Если исходящие.Количество() = 0 Тогда
		Возврат ответПоУмолчанию;
		
	КонецЕсли;
	
	индекс = исходящие.Количество();
	Пока индекс > 0 Цикл
		индекс = индекс - 1;
		исходящееОбъект = исходящие[индекс];
		
		Если ТипЗнч(исходящееОбъект) <> Тип("СправочникОбъект.обм_ИсходящиеСообщения") Тогда
			исходящие.Удалить(индекс);
			Продолжить;
			
		КонецЕсли;
			
		исходящееОбъект.Источник = пСсылкаИсточника;
		
		// Если обработчик отправки не заполнен, назначить этот обработчик обработчиком отправки
		Если Не ЗначениеЗаполнено(исходящееОбъект.ОбработчикОтправки) Тогда
			исходящееОбъект.ОбработчикОтправки = Справочники.общ_Обработчики.НайтиСсылку(РеализацияИнтерфейса);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат исходящие;
	
КонецФункции

#КонецОбласти // ПереопределяемыйИнтерфейс

#КонецОбласти // ПрограммныйИнтерфейс

// Инициализация по умолчанию
РеализацияИнтерфейса = ЭтотОбъект;