Процедура ПередЗаписью(Отказ, Замещение)
	
	// Регистр не предназначен для обмена, он сам часть подсистемы обмена
	// Поэтому записывать в режиме ОбменДанными.Загрузка
	// Чтобы не срабатывали сторонние подписки и не вызывали задержку
	ЭтотОбъект.ОбменДанными.Загрузка = Истина;
	
	Для Каждого запись Из ЭтотОбъект Цикл
		общ.ЕслиПустое(запись.ДатаВремя, общ.ДатаУниверсальная());
		общ.ЕслиПустое(запись.ВерсияДанных, запись.Ссылка.ВерсияДанных);
		
	КонецЦикла;
	запись = Неопределено;

КонецПроцедуры
