
&НаКлиенте
Процедура ОбработкаКоманды(пДанныеЗаполненияМассив, ПараметрыВыполненияКоманды)
	
	ОбработкаКомандыСервер(пДанныеЗаполненияМассив);

	Оповестить("ВходящиеСообщения_ИзмененыСтатусы");

КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыСервер(пДанныеЗаполненияМассив)
	
	массивВходящихЗапросов = Новый Массив;
	Для Каждого данныеЗаполненияСсылка Из пДанныеЗаполненияМассив Цикл
		входящееСообщениеСсылка = данныеЗаполненияСсылка.Владелец;
		
		Если Не общ.ЭтоЗаполненнаяСсылка(входящееСообщениеСсылка, Тип("СправочникСсылка.обм_ВходящиеСообщения")) Тогда
			Продолжить;
			
		КонецЕсли;
		
		массивВходящихЗапросов.Добавить(входящееСообщениеСсылка);

	КонецЦикла;
	данныеЗаполненияСсылка = Неопределено;  
	
	Если массивВходящихЗапросов.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;
	
	обработчик = Обработки.обм_ВходящиеСообщения_Обработка.Создать();
	
	обработчик.ВходящиеСообщения_ДанныеЗаполнения_Создать(массивВходящихЗапросов);
			
	обработчик.ВходящиеСообщения_ОбработатьДанныеЗаполнения(массивВходящихЗапросов);
	
КонецПроцедуры
