
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Узел = Неопределено;
	Категория = Неопределено;
	Идентификатор = Неопределено;
	Если 
			Параметры.Свойство("Узел", Узел) 
		И	Параметры.Свойство("Категория",Категория) 
		И	Параметры.Свойство("Идентификатор", Идентификатор) 
	Тогда
		общ.СКД_Отбор_Установить(Список.Отбор, "Узел", Узел);
		общ.СКД_Отбор_Установить(Список.Отбор, "Категория",Категория);
		общ.СКД_Отбор_Установить(Список.Отбор, "Идентификатор", Идентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(Поле) <> Тип("ПолеФормы") Тогда
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Приемник" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Приемник);
		
	ИначеЕсли Поле.Имя = "Владелец" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Владелец);
		
	// 20230728 Заяш
	// Стандартное открытие 
	Иначе
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры
