
Процедура ПередЗаписью(Отказ)
	
	// Убрать из табличной части дубли параметров и упорядочить табличную часть
	зпрс = Новый Запрос;
	зпрс.УстановитьПараметр("тзПараметры", Параметры.Выгрузить());
	зпрс.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	П.Ключ КАК Ключ,
	|	П.Значение КАК Значение,
	|	П.Период КАК Период
	|ПОМЕСТИТЬ тзПараметры
	|ИЗ
	|	&тзПараметры КАК П
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	П.Ключ КАК Ключ,
	|	П.Значение КАК Значение,
	|	П.Период КАК Период
	|ИЗ
	|	тзПараметры КАК П
	|
	|УПОРЯДОЧИТЬ ПО
	|	П.Ключ,
	|	П.Период"; 
	
	ЭтотОбъект.Параметры.Очистить();
	ЭтотОбъект.Параметры.Загрузить(зпрс.Выполнить().Выгрузить());	
	
КонецПроцедуры
