
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ДатаВремя = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	Получатели.Свернуть("Узел");
	Получатели.Сортировать("Узел");
	индекс = Получатели.Количество();
	Пока индекс > 0 Цикл
		индекс = индекс - 1;
		Если ПустаяСтрока(Получатели[индекс].Узел) Тогда
			Получатели.Удалить(индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	индекс = Неопределено;
	
	всеПолучатели = Получатели.ВыгрузитьКолонку("Узел");
	ПолучателиСтрокой = СтрСоединить(всеПолучатели, ",");
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Строка(Источник) + " >>>> " + ПолучателиСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры
