
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ДатаВремя = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	таблицаПолучателей = ЭтотОбъект.Получатели.Выгрузить();
	таблицаПолучателей.Свернуть("Узел");
	таблицаПолучателей.Сортировать("Узел");
	всеПолучатели = таблицаПолучателей.ВыгрузитьКолонку("Узел");
	ПолучателиСтрокой = СтрСоединить(всеПолучатели, ",");
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Строка(Источник) + " >>>> " + ПолучателиСтрокой;
		
	КонецЕсли;
	
КонецПроцедуры
