
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// При открытии этой формы из формы списка, установить курсор на поле узла
	// Чтобы пользователю было удобнее заполнять элементы
	Если ЗначениеЗаполнено(Запись.Ссылка) И Не ЗначениеЗаполнено(Запись.УзелПолучатель) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.УзелПолучатель; 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаЗаписать(Команда) 
	
	ЗаписатьИгнорируяОшибки();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИгнорируяОшибки();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаписатьИгнорируяОшибки()
	
	Попытка
		ЭтаФорма.Записать();
		
	Исключение
		обОшибке = ИнформацияОбОшибке(); // "Запись с такими ключевыми полями существует!"

	КонецПопытки;
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры
