&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Данные", ПараметрКоманды);
	Параметры.Вставить("Пользователь", "");
	Параметры.Вставить("СобытиеЖурналаРегистрации", "");
	
	// Использование ТекущаяДата здесь оправдано, т.к. это заполнение настроек отчета по умолчанию
	ПараметрДата = Новый Структура("Дата", НачалоДня(ТекущаяДата()));
	Параметры.Вставить("ДатаНачала", ПараметрДата.Дата);
	
	Параметры.Вставить("ОтбиратьОшибки", Истина);
	
	ОткрытьФорму("Обработка.общ_ЖурналРегистрации.Форма", Параметры, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры