
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Узел = Неопределено;
	Категория = Неопределено;
	Идентификатор = Неопределено;
	Если 
			Параметры.Свойство("Узел", Узел) 
		И	Параметры.Свойство("Категория",Категория) 
		И	Параметры.Свойство("Идентификатор", Идентификатор) 
	Тогда
		общ.СКД_Отбор_Установить(Список.Отбор, "Узел", Узел);
		общ.СКД_Отбор_Установить(Список.Отбор, "Категория",Категория);
		общ.СКД_Отбор_Установить(Список.Отбор, "Идентификатор", Идентификатор);
		
	КонецЕсли;
	
	ОбновитьЗаголовокОчередиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРазмерОчереди(Команда)
	
	ОбновитьЗаголовокОчередиНаСервере(Формат(ТекущаяДата(), "ДФ=HH:mm:ss")); // BSLLS:DeprecatedCurrentDate-off
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокОчередиНаСервере(Знач пВремя = "")
	
	Если ПустаяСтрока(пВремя) Тогда
		пВремя = Формат(ТекущаяДатаСеанса(), "ДФ=HH:mm:ss");
		
	КонецЕсли;
	
	состояние = Обработки.обм_Дашборд.Очередь_Состояние("ПакетыДанных");
	счётчик = Обработки.обм_Дашборд.Очередь_ТекстСчётчика(состояние.Остаток, состояние.Ошибки);
	Элементы.ПоказатьРазмерОчереди.Заголовок = СтрШаблон(
		"%1 Остаток %2. Нажмите здесь чтобы пересчитать",
		пВремя,
		счётчик);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(Поле) <> Тип("ПолеФормы") Тогда
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Владелец" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Владелец);
		
	// 20230728 Заяш
	// Стандартное открытие 
	Иначе
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;

КонецПроцедуры
