#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьПриемники(пПакетыДанных) Экспорт
	
	Если пПакетыДанных.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;
	
	обработчик = Обработки.обм_ПакетыДанных_Обработка.Создать();
	
	Для Каждого пакетСсылка Из пПакетыДанных Цикл
		обработчик.ПакетДанных_Обработать(пакетСсылка);
		
	КонецЦикла;
	пакетСсылка = Неопределено;
	
КонецПроцедуры

Функция ПолучитьОбъект(пВходящееСообщениеВладелец, пУзел, пКатегория, пИдентификатор) Экспорт
	
	общ.Проверка_Тип(пВходящееСообщениеВладелец, Тип("СправочникСсылка.обм_ВходящиеСообщения"));
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен параметр 'узел'";
		
	КонецЕсли;
	
	Если ПустаяСтрока(пУзел) Тогда
		ВызватьИсключение "Не заполнен параметр 'категория'";
		
	КонецЕсли;
	
	Если ПустаяСтрока(пИдентификатор) Тогда
		ВызватьИсключение "Не заполнен параметр 'идентификатор'";
		
	КонецЕсли;
	
	запрос = Новый Запрос;
	запрос.УстановитьПараметр("пВходящееСообщениеВладелец", пВходящееСообщениеВладелец);
	запрос.УстановитьПараметр("Узел", пУзел);
	запрос.УстановитьПараметр("Категория", пКатегория);
	запрос.УстановитьПараметр("Идентификатор", пИдентификатор);
	запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПакетыДанных.Ссылка КАК ПакетДанных,
	|	ВходящиеСообщения.ДатаВремя КАК ДатаВремя
	|ИЗ
	|	Справочник.обм_ПакетыДанных КАК ПакетыДанных,
	|	Справочник.обм_ВходящиеСообщения КАК ВходящиеСообщения
	|ГДЕ
	|	ПакетыДанных.Владелец = &пВходящееСообщениеВладелец
	|	И ПакетыДанных.Узел = &Узел
	|	И ПакетыДанных.Категория = &Категория
	|	И ПакетыДанных.Идентификатор = &Идентификатор
	|	И ВходящиеСообщения.Ссылка = &пВходящееСообщениеВладелец";
	
	выборка = запрос.Выполнить().Выбрать();
	
	пакетДанныхОбъект = Неопределено;
	выборка.Следующий();
	
	Если выборка.ПакетДанных = Null Тогда 
		пакетДанныхОбъект = Справочники.обм_ПакетыДанных.СоздатьЭлемент();
		
	Иначе
		пакетДанныхОбъект = выборка.ПакетДанных.ПолучитьОбъект();
		
	КонецЕсли; 
	
	пакетДанныхОбъект.Владелец = пВходящееСообщениеВладелец;
	пакетДанныхОбъект.ДатаВремя = выборка.ДатаВремя;
	пакетДанныхОбъект.ПометкаУдаления = Ложь;
	пакетДанныхОбъект.Узел = пУзел;
	пакетДанныхОбъект.Категория = пКатегория;
	пакетДанныхОбъект.Идентификатор = пИдентификатор;
	пакетДанныхОбъект.Данные = Неопределено; 
	
	Возврат пакетДанныхОбъект;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли // #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
