
Процедура ПередЗаписью(Отказ) 
	
	общ.СправочникОбъект_УстановитьУИДкакКод(ЭтотОбъект);

	ЭтотОбъект.Наименование =
		СтрШаблон(
			"%1 %2 ид: %3 владелец: %4",
			Узел, // %1
			Категория, // %2
			Идентификатор, // %3
			Строка(ЭтотОбъект.Владелец.УникальныйИдентификатор()) // %4
			);

		Данные_Длина = СтрДлина(Данные);

	Если Не ПустаяСтрока(Данные) Тогда
		Хеширование = Новый ХешированиеДанных(ХешФункция.sha256);
		Хеширование.Добавить(Данные);
		Данные_sha256 = Строка(Хеширование.ХешСумма);
		
	Иначе
		Данные = Неопределено;
		Данные_sha256 = Неопределено;
		
	КонецЕсли;

	Если ПустаяСтрока(Данные_sha256) Тогда
		Данные_sha256 = Неопределено;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаВремя) Тогда
		ЭтотОбъект.ДатаВремя = общ.ДатаУниверсальная();
		
	КонецЕсли;
		
КонецПроцедуры
